app/views/admin/_posts_table.html.erb

                    <td><%= post.category.name %></td>
                    <td><%= post.comments.count %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 15]]