app/views/admin/index.html.erb

  var ctx = document.getElementById("myChart");
  var myChart = new Chart(ctx, {
    type: 'bar',
    data: {
      labels: ["Users", "Posts", "Comments", "Subscriptors"],
      datasets: [{
        data: [<%= @users.count %>, <%= @posts.count %>, <%= @comments %>, <%= @subscriptors.count %>],
        lineTension: 0,
        backgroundColor: 'transparent',
        borderColor: '#007bff',
        borderWidth: 4,
        pointBackgroundColor: '#007bff'
      }]
    },
    options: {
      scales: {
        yAxes: [{
          ticks: {
            beginAtZero: false
          }
        }]
      },
---
SELECT COUNT(*) FROM "comments"
SELECT COUNT(*) FROM "posts"
SELECT COUNT(*) FROM "subscriptors"
SELECT COUNT(*) FROM "users"