app/views/posts/_categories.html.erb

    <nav class="nav d-flex justify-content-between">
      <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"