app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories"
---
                <label>Category</label>
                <%= f.collection_select(:category_id, Category.all, :id, :name, { prompt: "Choose a Category" }, {class: "form-control"}) %>