app/views/posts/index.html.erb

SELECT "categories".* FROM "categories"
---

  <%unless params[:category].present? %>

SELECT "categories".* FROM "categories"
---
      <h3 class="pb-3 mb-4 font-italic border-bottom" id="posts">
        <% if params[:category].present? %>