app/views/posts/show.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = ? LIMIT ?  [["post_id", 9], ["LIMIT", 1]]
---
        </div><!-- /.blog-post -->
        <% if @post.comments.exists? %>