app/controllers/admin_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts"
SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "comments"
SELECT "subscriptors".* FROM "subscriptors" ORDER BY "subscriptors"."created_at" DESC
---
  def index
    @users = User.all.order(created_at: :desc)
    @posts = Post.all.order(created_at: :desc)
    @comments = Comment.all.count
    @subscriptors = Subscriptor.all.order(created_at: :desc)

SELECT "products".* FROM "products" ORDER BY "products"."created_at" DESC
---
  def products
    @products = Product.all.order(created_at: :desc)