app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Post de tenis"], ["updated_at", "2018-12-04 01:23:29.081648"], ["id", 9]]