app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories"
SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
SELECT  "posts".* FROM "posts" ORDER BY "posts"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Shoes"], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" = ? ORDER BY "posts"."id" DESC LIMIT ?  [["category_id", 8], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Jeans"], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."category_id" = ? ORDER BY "posts"."id" DESC LIMIT ?  [["category_id", 12], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."category_id" = ?  [["category_id", 13]]
---
  def index
    if params[:category].blank?
      @posts = Post.all
                   .order(created_at: :desc)
                   .paginate(page: params[:page], per_page: 2)
      @last_post = Post.last

      #last posts in category shoes
      @shoes_category = Category.find_by(name: "Shoes")
      @shoes_last_post = @shoes_category.posts.last

      #last post in category jeans
      @jeans_category = Category.find_by(name: "Jeans")
      @jeans_last_post = @jeans_category.posts.last
    else
    @category_id = Category.find_by(name: params[:category]).id
    @posts = Post.where(category_id: @category_id)
                 .order(created_at: :desc)
                 .paginate(page: params[:page], per_page: 2)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" DESC LIMIT ? OFFSET ?  [["post_id", 1], ["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
  def show
    @post = Post.find(params[:id])
    @comments = @post.comments.order(created_at: :desc).paginate(page: params[:page], per_page: 2)

INSERT INTO "posts" ("user_id", "title", "content", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", 0]]
SELECT "subscriptors".* FROM "subscriptors"
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    if @post.save
      # Send email to users with new post link
      title = @post.title
      id = @post.id
      users = User.where(role: "user")
      subscriptors = Subscriptor.all

      users.each do |user|
       email = user.email
       type_user = "User"
       UserNotifierMailer.new_post_notifying(email, title, id, type_user).deliver_now
      end

      subscriptors.each do |subscriptor|

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "category_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "dasdasdadas"], ["category_id", 9], ["updated_at", "2018-12-08 01:03:21.606729"], ["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", 0]]
SELECT "subscriptors".* FROM "subscriptors"
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
      title = @post.title
      id = @post.id
      users = User.where(role: "user")
      subscriptors = Subscriptor.all

    users.each do |user|
      email = user.email
      type_user = "User"
      UserNotifierMailer.edit_post_notifying(email, title, id, type_user).deliver_now
    end

    subscriptors.each do |subscriptor|

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 15]]
---
  def destroy
    post = Post.find(params[:id])
    post.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "posts" SET "published_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["published_at", "2018-12-13 01:29:55.342971"], ["updated_at", "2018-12-13 01:29:55.346036"], ["id", 9]]
---
  def publish
    sleep 2
    @post = Post.find(params[:id])
    @post.update(published_at: Time.zone.now)