app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Susana"], ["price", 1000], ["active", 1], ["created_at", "2018-12-12 02:06:53.671239"], ["updated_at", "2018-12-12 02:06:53.671239"]]
---
  def create
    @product = Product.create(product_params)