app/controllers/subscriptors_controller.rb

INSERT INTO "subscriptors" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "fabio"], ["email", "alonso@gmail.com"], ["created_at", "2018-11-30 00:22:26.600206"], ["updated_at", "2018-11-30 00:22:26.600206"]]
---
  def create
    @subscriptor = Subscriptor.new(suscriptor_params)
    if @subscriptor.save