app/models/user.rb

  def subscriptor?
   Subscriptor.all.map(&:email).include? self.email
---
SELECT "subscriptors".* FROM "subscriptors"